# import os
# import django
#
# # Указываем Django, где искать настройки
# os.environ.setdefault('DJANGO_SETTINGS_MODULE', 'diplommain.settings')  # Замените "myproject" на название вашего проекта
# django.setup()
#
# from django.db import connection
# from main.models import FirstVariantBd
# with connection.cursor() as cursor:
#     cursor.execute("DELETE FROM main_firstvariantbd")
#     cursor.execute("VACUUM")

#
# # Получаем все значения из столбца scientific_speciality
# scientific_specialities = FirstVariantBd.objects.values_list('scientific_speciality', flat=True)
#
# # Выводим данные
# for speciality in scientific_specialities:
#     if 'Юриспруденция' in speciality:
#         print(speciality)
# from main.views import user_data
#
# print(user_data)

# s = {'Преподаватель': 'Иванов И.И.', 'Наименование предмета': 'Web-технологии', 'Направление': '38.03.01 - Экономика', 'competencies': [], 'topics': [{'topic': '54353', 'description':
# 'advafvd'}], 'curriculum': [{'profiles': 'Бизнес и финансы социальной сферы, Государственное и корпоративное казначейство, Государственные и муниципальные финансы, Государственный финансовый контроль, Управление финансовыми рисками и страхование, Финансы и банковское дело, Финансы и управление финансовыми активами', 'topics': [{'topic': '54353', 'total': '12', 'classroom': '3', 'lectures': '1', 'seminars': '1', 'independent': '3'}, {'topic': '', 'total': '108', 'classroom': '34', 'lectures': '16', 'seminars': '18', 'independent': '74'
# }]}, {'profiles': 'Финансы и инвестиции', 'topics': [{'topic': '54353', 'total': '34', 'classroom': '12', 'lectures': '4', 'seminars': '3', 'independent': '42'}, {'topic': '', 'total': '108', 'classroom': '24', 'lectures': '8', 'seminars': '16', 'independent': '84'}]}]}
#
# for i in s:
#     print(i)

s = {'Преподаватель': 'Иванов И.И.', 'Наименование предмета': 'Web-технологии', 'Направление': '38.03.01 - Экономика', 'Образовательная программа': 'Экономика и финансы', 'competencies': [{'profile': '«Бизн
ес и финансы социальной сферы»', 'competence_code': 'УК-4', 'competence_name': 'Способность использовать прикладное программное обеспечение при решении профессиональных задач', 'indicators': ['мвам'], 'know': ['rbfgg'], 'do': ['
ghmghm'], 'rowspan': 2, 'indicators_with_know_do': [['мвам', 'rbfgg', 'ghmghm']]}, {'profile': '«Бизнес и финансы социальной сферы»', 'competence_code': 'ПКН-7', 'competence_name': 'Способность применять знания для просветительс
кой деятельности в области основ экономических знаний', 'indicators': ['dtynet'], 'know': ['fgndghn'], 'do': ['etyndghn'], 'rowspan': 2, 'indicators_with_know_do': [['dtynet', 'fgndghn', 'etyndghn']]}, {'profile': '«Бизнес и фин
ансы социальной сферы»', 'competence_code': 'ПКП-4', 'competence_name': 'Способность к использованию специальных программных продуктов, применяемых для выполнения бухгалтерско-аналитических и контрольных функций в экономическом
субъекте', 'indicators': ['dghmryun'], 'know': ['dhndg'], 'do': ['dmfhm'], 'rowspan': 2, 'indicators_with_know_do': [['dghmryun', 'dhndg', 'dmfhm']]}, {'profile': '«Государственное и корпоративное казначейство»', 'competence_cod
e': 'УК-4', 'competence_name': 'Способность использовать прикладное программное обеспечение при решении профессиональных задач', 'indicators': ['sfdbsf'], 'know': ['rtjetym'], 'do': ['ti.kj'], 'rowspan': 2, 'indicators_with_know
_do': [['sfdbsf', 'rtjetym', 'ti.kj']]}, {'profile': '«Государственное и корпоративное казначейство»', 'competence_code': 'ПКН-7', 'competence_name': 'Способность применять знания для просветительской деятельности в области осно
в экономических знаний', 'indicators': ['fhgmgfhn'], 'know': ['bsfbs'], 'do': ['nfhmfghnm'], 'rowspan': 2, 'indicators_with_know_do': [['fhgmgfhn', 'bsfbs', 'nfhmfghnm']]}, {'profile': '«Государственное и корпоративное казначейс
тво»', 'competence_code': 'ПКП-1', 'competence_name': 'Способность выполнять аудиторские процедуры (действия) и оказывать прочие услуги, связанные с аудиторской деятельностью', 'indicators': ['gavdfvsf'], 'know': ['ngdhmf'], 'do
': ['o.lyi,g'], 'rowspan': 2, 'indicators_with_know_do': [['gavdfvsf', 'ngdhmf', 'o.lyi,g']]}, {'profile': '«Государственные и муниципальные финансы»', 'competence_code': 'ПКП-1', 'competence_name': 'Способность выполнять аудито
рские процедуры (действия) и оказывать прочие услуги, связанные с аудиторской деятельностью', 'indicators': ['dyjnedbtgf'], 'know': ['aervdf'], 'do': ['etyjryn'], 'rowspan': 2, 'indicators_with_know_do': [['dyjnedbtgf', 'aervdf'
, 'etyjryn']]}, {'profile': '«Государственные и муниципальные финансы»', 'competence_code': 'УК-4', 'competence_name': 'Способность использовать прикладное программное обеспечение при решении профессиональных задач', 'indicators
': ['ervfd'], 'know': ['ktuilt,'], 'do': ['t,ui,mghjndgb'], 'rowspan': 2, 'indicators_with_know_do': [['ervfd', 'ktuilt,', 't,ui,mghjndgb']]}, {'profile': '«Государственные и муниципальные финансы»', 'competence_code': 'ПКН-7', 
'competence_name': 'Способность применять знания для просветительской деятельности в области основ экономических знаний', 'indicators': ['qcasdca'], 'know': ['qervwr'], 'do': ['jryurmj'], 'rowspan': 2, 'indicators_with_know_do':
 [['qcasdca', 'qervwr', 'jryurmj']]}, {'profile': '«Государственный финансовый контроль»', 'competence_code': 'ПКН-7', 'competence_name': 'Способность применять знания для просветительской деятельности в области основ экономичес
ких знаний', 'indicators': ['etyndfgb'], 'know': ['wrevsdfb'], 'do': ['rukmtyum'], 'rowspan': 2, 'indicators_with_know_do': [['etyndfgb', 'wrevsdfb', 'rukmtyum']]}, {'profile': '«Государственный финансовый контроль»', 'competenc
e_code': 'УК-4', 'competence_name': 'Способность использовать прикладное программное обеспечение при решении профессиональных задач', 'indicators': ['wrtbsdvad'], 'know': ['umtui,'], 'do': ['yio.yioly'], 'rowspan': 2, 'indicator
s_with_know_do': [['wrtbsdvad', 'umtui,', 'yio.yioly']]}, {'profile': '«Государственный финансовый контроль»', 'competence_code': 'ПКП-1', 'competence_name': 'Способность выполнять аудиторские процедуры (действия) и оказывать пр
очие услуги, связанные с аудиторской деятельностью', 'indicators': ['wrgaas'], 'know': ['кеноегд'], 'do': ['ншщделоатрвп'], 'rowspan': 2, 'indicators_with_know_do': [['wrgaas', 'кеноегд', 'ншщделоатрвп']]}, {'profile': '«Управле
ние финансовыми рисками и страхование»', 'competence_code': 'УК-4', 'competence_name': 'Способность использовать прикладное программное обеспечение при решении профессиональных задач', 'indicators': ['енткнгл'], 'know': ['егшлде
'], 'do': ['кьпртвапи'], 'rowspan': 2, 'indicators_with_know_do': [['енткнгл', 'егшлде', 'кьпртвапи']]}, {'profile': '«Управление финансовыми рисками и страхование»', 'competence_code': 'ПКП-4', 'competence_name': 'Способность к
 использованию специальных программных продуктов, применяемых для выполнения бухгалтерско-аналитических и контрольных функций в экономическом субъекте', 'indicators': ['уенок8лд'], 'know': ['шгдлоа'], 'do': ['аиывм'], 'rowspan':
 2, 'indicators_with_know_do': [['уенок8лд', 'шгдлоа', 'аиывм']]}, {'profile': '«Управление финансовыми рисками и страхование»', 'competence_code': 'ПКН-7', 'competence_name': 'Способность применять знания для просветительской д
еятельности в области основ экономических знаний', 'indicators': ['фвсчм'], 'know': ['кперин'], 'do': ['ешднб'], 'rowspan': 2, 'indicators_with_know_do': [['фвсчм', 'кперин', 'ешднб']]}, {'profile': '«Финансы и банковское дело»'
, 'competence_code': 'УК-4', 'competence_name': 'Способность использовать прикладное программное обеспечение при решении профессиональных задач', 'indicators': ['аобьапви'], 'know': ['еокгдег'], 'do': ['ьаррп'], 'rowspan': 2, 'i
ndicators_with_know_do': [['аобьапви', 'еокгдег', 'ьаррп']]}, {'profile': '«Финансы и банковское дело»', 'competence_code': 'ПКН-7', 'competence_name': 'Способность применять знания для просветительской деятельности в области ос
нов экономических знаний', 'indicators': ['цмывац'], 'know': ['екриуен'], 'do': ['7889днбпьро'], 'rowspan': 2, 'indicators_with_know_do': [['цмывац', 'екриуен', '7889днбпьро']]}, {'profile': '«Финансы и банковское дело»', 'compe
tence_code': 'ПКП-1', 'competence_name': 'Способность выполнять аудиторские процедуры (действия) и оказывать прочие услуги, связанные с аудиторской деятельностью', 'indicators': ['апивапвт'], 'know': ['бюрлоюбь'], 'do': ['ратпви
вп'], 'rowspan': 2, 'indicators_with_know_do': [['апивапвт', 'бюрлоюбь', 'ратпвивп']]}, {'profile': '«Финансы и управление финансовыми активами»', 'competence_code': 'УК-4', 'competence_name': 'Способность использовать прикладно
е программное обеспечение при решении профессиональных задач', 'indicators': ['ыапиаиуе'], 'know': ['кгегшбнш'], 'do': ['твпиыа'], 'rowspan': 2, 'indicators_with_know_do': [['ыапиаиуе', 'кгегшбнш', 'твпиыа']]}, {'profile': '«Фин
ансы и управление финансовыми активами»', 'competence_code': 'ПКН-7', 'competence_name': 'Способность применять знания для просветительской деятельности в области основ экономических знаний', 'indicators': ['аншдншщлн'], 'know':
 ['шбпрь'], 'do': ['иыпам'], 'rowspan': 2, 'indicators_with_know_do': [['аншдншщлн', 'шбпрь', 'иыпам']]}, {'profile': '«Финансы и управление финансовыми активами»', 'competence_code': 'ПКП-1', 'competence_name': 'Способность вып
олнять аудиторские процедуры (действия) и оказывать прочие услуги, связанные с аудиторской деятельностью', 'indicators': ['ыптнкг'], 'know': ['бгобьар'], 'do': ['пттвп'], 'rowspan': 2, 'indicators_with_know_do': [['ыптнкг', 'бго
бьар', 'пттвп']]}, {'profile': '«Финансы и инвестиции»', 'competence_code': 'УК-4', 'competence_name': 'Способность использовать прикладное программное обеспечение при решении профессиональных задач', 'indicators': ['ыаитнк'], '
know': ['нгбегшб'], 'do': ['ьпрт'], 'rowspan': 2, 'indicators_with_know_do': [['ыаитнк', 'нгбегшб', 'ьпрт']]}, {'profile': '«Финансы и инвестиции»', 'competence_code': 'ПКП-4', 'competence_name': 'Способность к использованию спе
циальных программных продуктов, применяемых для выполнения бухгалтерско-аналитических и контрольных функций в экономическом субъекте', 'indicators': ['впрьег'], 'know': ['егшбпоь'], 'do': ['аробполбп'], 'rowspan': 2, 'indicators
_with_know_do': [['впрьег', 'егшбпоь', 'аробполбп']]}, {'profile': '«Финансы и инвестиции»', 'competence_code': 'ПКН-7', 'competence_name': 'Способность применять знания для просветительской деятельности в области основ экономич
еских знаний', 'indicators': ['гшбьарт'], 'know': ['вптпрь'], 'do': ['егшбполб'], 'rowspan': 2, 'indicators_with_know_do': [['гшбьарт', 'вптпрь', 'егшбполб']]}], 'topics': {'Бизнес и финансы социальной сферы, Государственное и к
орпоративное казначейство, Государственные и муниципальные финансы, Государственный финансовый контроль, Управление финансовыми рисками и страхование, Финансы и банковское дело, Финансы и управление финансовыми активами': [{'top
ic': 'Тема 1. Web-технологии: современное состояние и перспективы  развития', 'description': 'История возникновения и развития интернета. Логическая и физическая  модели интернета. Взаимодействие клиент-сервер. Концепции Web 1.0
, Web  2.0 и Web 3.0. Сравнительная характеристика и ограничения концепций.  Модели предоставления услуг через интернет. Web-технологии в цифровой  экономике: интернет вещей и промышленный интернет. Экосистемы и  метавселенные.
Перспективы развития интернет-технологий. Web 4.0.', 'time': 108}], 'Финансы и инвестиции': [{'topic': 'Тема 2. Web-технологии в финансовой отрасли', 'description': 'Использование Web-технологий в финансовой отрасли. Электронный
  документооборот. Принципы организация безналичных расчетов. Неттинг как  способ снижения транзакционных издержек. Системы валовых расчетов.  12  Технологии осуществления платежей в режиме реального времени. Системы  дистанцион
ного банковского обслуживания. Электронная коммерция. B2B,  B2C, P2P-платежи. Интернет-трейдинг. Web-технологии, используемые  регуляторами. Методы сбора структурированной и неструктурированной  информации в сети.  Трансформация
 принципов взаимодействия с клиентами. Обеспечение  клиентоцентричности, концепц', 'time': 108}]}, 'curriculum': {'Профили: Бизнес и финансы социальной сферы, Государственное и корпоративное казначейство, Государственные и муниц
ипальные финансы, Государственный финансовый контроль, Управление финансовыми рисками и страхование, Финансы и банковское дело, Финансы и управление финансовыми активами': {'Тема 1. Web-технологии: современное состояние и перспе
ктивы  развития': {'classroom': '78', 'lectures': '56', 'seminars': '22', 'independent': '30'}}, 'Профили: Финансы и инвестиции': {'Тема 2. Web-технологии в финансовой отрасли': {'classroom': '89', 'lectures': '67', 'seminars': 
'22', 'independent': '19'}}}, 'seminars_content': [{'topic': 'Тема 1. Web-технологии: современное состояние и перспективы  развития', 'questions': ['Концепции Web 1.0, Web 2.0 и Web 3.0.   Сравнительная характеристика и  огранич
ения концепций.  – Web-технологии в '], 'form': 'Web-технологии в цифровой  экономике: интернет вещей и  промышленный интернет.  Рекомендуемые источники: 1, 2, 5, 19. '}, {'topic': 'Тема 2. Web-технологии в финансовой отрасли', 
'questions': ['Системы дистанционного банковского  обслуживания.'], 'form': 'Трансформация принципов  взаимодействия с клиентами. Обеспечение  клиентоцентричности, концепция CRM.  Новые каналы взаимодействия с  клиентами. Омника
нальность.  Рекомендуемые источники: 5, 6, 7. '}], 'questions_list': [{'topic': 'Тема 1. Web-технологии: современное состояние и перспективы  развития', 'questions': ['Концепции Web 1.0, Web 2.0 и Web 3.0.   Сравнительная характ
еристика и  ограничения концепций.  – Web-технологии в '], 'form': 'Web-технологии в цифровой  экономике: интернет вещей и  промышленный интернет.  Рекомендуемые источники: 1, 2, 5, 19. '}, {'topic': 'Тема 2. Web-технологии в фи
нансовой отрасли', 'questions': ['Системы дистанционного банковского  обслуживания.'], 'form': 'Трансформация принципов  взаимодействия с клиентами. Обеспечение  клиентоцентричности, концепция CRM.  Новые каналы взаимодействия с
  клиентами. Омниканальность.  Рекомендуемые источники: 5, 6, 7. '}], 'questions_work': ['Андрей Вадимович Суслов'], 'control_tasks': {'«Бизнес и финансы социальной сферы': [{'competence_code': 'УК-4', 'competence_name': 'Способ
ность использовать прикладное программное обеспечение при решении профессиональных задач', 'indicator': 'мвам', 'know': 'rbfgg', 'do': 'ghmghm', 'task': ['ветвпрь']}, {'competence_code': 'ПКН-7', 'competence_name': 'Способность
применять знания для просветительской деятельности в области основ экономических знаний', 'indicator': 'dtynet', 'know': 'fgndghn', 'do': 'etyndghn', 'task': ['gend']}, {'competence_code': 'ПКП-4', 'competence_name': 'Способност
ь к использованию специальных программных продуктов, применяемых для выполнения бухгалтерско-аналитических и контрольных функций в экономическом субъекте', 'indicator': 'dghmryun', 'know': 'dhndg', 'do': 'dmfhm', 'task': ['bfgdn
dg']}], '«Государственное и корпоративное казначейство': [{'competence_code': 'УК-4', 'competence_name': 'Способность использовать прикладное программное обеспечение при решении профессиональных задач', 'indicator': 'sfdbsf', 'k
now': 'rtjetym', 'do': 'ti.kj', 'task': ['wbrtbs']}]}, 'example_quest': ['fgnfgn']}
